-- Вставка данных о персонажах
INSERT INTO characters (id, name, level, health, max_health, hit_power, shield, agility, type)
VALUES (1, 'Воин', 1, 100, 100, 20, 10, 0.7, 'WARRIOR'),
       (2, 'Маг', 1, 80, 80, 10, 5, 0.8, 'MAGE'),
       (3, 'Вор', 1, 70, 70, 15, 3, 0.9, 'ROGUE'),
       (4, 'Жрец', 1, 90, 90, 12, 8, 0.6, 'CLERIC');

INSERT INTO dungeons (id, levels)
VALUES (1, 3),
       (2, 5),
       (3, 10),
       (4, 15),
       (5, 20);

INSERT INTO monsters (id, name, level, health, max_health, hit_power)
VALUES (1, 'Гоблин', 1, 50, 50, 10),
       (2, 'Орк', 2, 80, 80, 15),
       (3, 'Дракон', 10, 500, 500, 60),
       (4, 'Вурдалак', 5, 150, 150, 30),
       (5, 'Зомби', 3, 75, 75, 12),
       (6, 'Оборотень', 4, 90, 90, 18),
       (7, 'Гигантский паук', 2, 40, 40, 8),
       (8, 'Слизень', 1, 30, 30, 5),
       (9, 'Тролль', 7, 200, 200, 35),
       (10, 'Огненный элементаль', 8, 250, 250, 45),
       (11, 'Вампир', 6, 120, 120, 25),
       (12, 'Виверна', 9, 300, 300, 55),
       (13, 'Демон', 11, 400, 400, 75),
       (14, 'Призрак', 5, 130, 130, 22),
       (15, 'Ведьма', 3, 70, 70, 15),
       (16, 'Мумия', 4, 95, 95, 20),
       (17, 'Железный голем', 12, 600, 600, 40),
       (18, 'Медуза', 7, 180, 180, 30),
       (19, 'Горгон', 8, 210, 210, 40),
       (20, 'Эльфийская тень', 6, 140, 140, 25),
       (21, 'Архидьявол', 14, 700, 700, 130),
       (22, 'Шаман орков', 7, 170, 170, 28);

INSERT INTO items (id, name, description, type, buff)
VALUES (1, 'Меч', 'Острый меч для ближнего боя.', 'WEAPON', 10),
       (2, 'Посох мага', 'Магический посох для заклинаний.', 'WEAPON', 10),
       (3, 'Кольцо здоровья', 'Увеличивает здоровье персонажа.', 'HEALTH', 30),
       (4, 'Щит', 'Защищает от ударов монстров.', 'SHIELD', 10),
       (5, 'Зелье лечения', 'Восстанавливает здоровье.', 'HEALTH_POTION', 30),
       (6, 'Лук', 'Оружие для дальнего боя.', 'WEAPON', 10),
       (7, 'Кольцо огня', 'Добавляет огненный урон атакам.', 'WEAPON', 5);
